#+TITLE: Aula 13
#+AUTHOR:老是:小. 学生: 小白色 佩德罗.

#+LATEX_COMPILER: xelatex
#+LATEX_HEADER: \usepackage{xltxtra}
#+LATEX_HEADER: \setmainfont{Source Han Sans CN}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[edges]{forest}
#+LATEX_HEADER: \usepackage[all]{genealogytree}
#+LATEX_HEADER: \usetikzlibrary{shadows.blur}


* Cultura

** Árvore Genealógica

*** Árvore genealógica (desenho)

    # #+HEADER: :file ./contour.svg :imagemagick yes
    # #+HEADER: :results output silent :headers '("\\usepackage{tikz} \\usepackage[edges]{forest}")
    # #+header: :fit yes :imoutoptions -geometry 400 :iminoptions -density 600
    #+begin_src latex
      \resizebox{\textwidth}{!}{
        \begin{tikzpicture}
          \genealogytree[template=signpost, id suffix=@p]
          {
            child{
              g[male]{paternal grandfather}
              p[female]{paternal grandmother}
              % child{
              %   g[male]{paternal uncle}
              %   c[male]{cousin}
              %   child{
              %     g[female]{cousin}
              %   }
              % }
              % child{
              %   g[female]{paternal aunt}
              %   c[male]{cousin}
              %   child{
              %     g[female]{cousin}
              %   }
              % }
              % % OLD WAY
              % % child[phantom*]{
              % g[male,id=father]{father}
              % p[female]{mother}
              % c[male]{brother}
              % c{\textsc{ego}}
              % c[female]{sister}
              % }
              %   MIRRORED FROM MATERNAL TREE (SEE FIRST IMAGE)
              %   child[phantom*]{
              %   p[male,id=father]{father}
              %   g[female]{mother}
              %   child{
              %   g[male]{brother}
              %   c[male]{nephew}
              %   child{
              %   g[female]{niece}
              % }
              % }
              %   child{
              %   g{\textsc{ego}}
              %   c[male]{son}
              %   child{
              %   g[female]{daughter}
              % }
              % }
              %   child{
              %   g[female]{sister}
              %   c[male]{nephew}
              %   child{
              %   g[female]{niece}
              % }
              % }
              % }
              % }
              %   MIRRORED FROM MATERNAL TREE WITH THE TWEAK (SEE SECOND IMAGE)
              child[phantom*]{
                g[male,id=father]{father}
                p[female]{mother}
                child{
                  g[male]{brother}
                  c[male]{nephew}
                  child{
                    g[female]{niece}
                  }
                }
                child{
                  g{\textsc{ego}}
                  c[male]{son}
                  child{
                    g[female]{daughter}
                  }
                }
                child{
                  g[female]{sister}
                  c[male]{nephew}
                  child{
                    g[female]{niece}
                  }
                }
              }
            }
          }
          \genealogytree[template=signpost, id suffix=@m, set position=father@m at father@p]
          {
            child{
              g[male]{maternal grandfather}
              p[female]{maternal grandmother}
              child{
                p[male,id=father]{father}
                g[female]{mother}
                child{
                  g[male]{brother}
                  c[male]{nephew}
                  child{
                    g[female]{niece}
                  }
                }
                child{
                  g{\textsc{ego}}
                  c[male]{son}
                  child{
                    g[female]{daughter}
                  }
                }
                child{
                  g[female]{sister}
                  c[male]{nephew}
                  child{
                    g[female]{niece}
                  }
                }
              }
              % child{
              %   g[male]{maternal uncle}
                % c[male]{cousin}
                % c[female]{cousin}
              % }
              % child{
              %   g[female]{maternal aunt}
                % c[male]{cousin}
                % c[female]{cousin}
              % }
            }
          }

        \end{tikzpicture}
      }
    #+end_src

    #+RESULTS:
    #+begin_export latex
    \resizebox{\textwidth}{!}{
      \begin{tikzpicture}
        \genealogytree[template=signpost, id suffix=@p]
        {
          child{
            g[male]{paternal grandfather}
            p[female]{paternal grandmother}
            % child{
            %   g[male]{paternal uncle}
            %   c[male]{cousin}
            %   child{
            %     g[female]{cousin}
            %   }
            % }
            % child{
            %   g[female]{paternal aunt}
            %   c[male]{cousin}
            %   child{
            %     g[female]{cousin}
            %   }
            % }
            % % OLD WAY
            % % child[phantom*]{
            % g[male,id=father]{father}
            % p[female]{mother}
            % c[male]{brother}
            % c{\textsc{ego}}
            % c[female]{sister}
            % }
            %   MIRRORED FROM MATERNAL TREE (SEE FIRST IMAGE)
            %   child[phantom*]{
            %   p[male,id=father]{father}
            %   g[female]{mother}
            %   child{
            %   g[male]{brother}
            %   c[male]{nephew}
            %   child{
            %   g[female]{niece}
            % }
            % }
            %   child{
            %   g{\textsc{ego}}
            %   c[male]{son}
            %   child{
            %   g[female]{daughter}
            % }
            % }
            %   child{
            %   g[female]{sister}
            %   c[male]{nephew}
            %   child{
            %   g[female]{niece}
            % }
            % }
            % }
            % }
            %   MIRRORED FROM MATERNAL TREE WITH THE TWEAK (SEE SECOND IMAGE)
            child[phantom*]{
              g[male,id=father]{father}
              p[female]{mother}
              child{
                g[male]{brother}
                c[male]{nephew}
                child{
                  g[female]{niece}
                }
              }
              child{
                g{\textsc{ego}}
                c[male]{son}
                child{
                  g[female]{daughter}
                }
              }
              child{
                g[female]{sister}
                c[male]{nephew}
                child{
                  g[female]{niece}
                }
              }
            }
          }
        }
        \genealogytree[template=signpost, id suffix=@m, set position=father@m at father@p]
        {
          child{
            g[male]{maternal grandfather}
            p[female]{maternal grandmother}
            child{
              p[male,id=father]{father}
              g[female]{mother}
              child{
                g[male]{brother}
                c[male]{nephew}
                child{
                  g[female]{niece}
                }
              }
              child{
                g{\textsc{ego}}
                c[male]{son}
                child{
                  g[female]{daughter}
                }
              }
              child{
                g[female]{sister}
                c[male]{nephew}
                child{
                  g[female]{niece}
                }
              }
            }
            % child{
            %   g[male]{maternal uncle}
              % c[male]{cousin}
              % c[female]{cousin}
            % }
            % child{
            %   g[female]{maternal aunt}
              % c[male]{cousin}
              % c[female]{cousin}
            % }
          }
        }

      \end{tikzpicture}
    }
    #+end_export

    **

*** Vocabulário

**** Pai e Mãe
     爸爸 (ba4ba - pai) 妈妈 (ma1ma - mãe)
     1) 爷爷 (ye2ye - vô paterno), 奶奶 (nai3nai - vó paterna)
     2)  姥爷 (lao3ye - vô materno [Norte da China]), 姥姥 (lao3lao -
        vó materna [Norte da China])
     3) 外公 (wai4gong1 - vô materno [Sul da China]),  外婆 (wai4po2 -
        vó materna)
